In [1]:
import pandas as pd

In [2]:
datos = {"nombre":["Pedro","Juan","Lorena"], "edad": [25,39,33]}
datos

{'nombre': ['Pedro', 'Juan', 'Lorena'], 'edad': [25, 39, 33]}

In [3]:
df=pd.DataFrame(datos)
df

   nombre  edad
0   Pedro    25
1    Juan    39
2  Lorena    33

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df["nombre"]

0     Pedro
1      Juan
2    Lorena
Name: nombre, dtype: object

In [6]:
type(df.nombre)

pandas.core.series.Series